export type Vacancy = {
  id: number;
  title: string;
  department: string;
  type: string;
  requirements: string[];
  conditions: string;
  href?: string;
};

export const vacancies: Vacancy[] = [
  {
    id: 5,
    title: "Старший науковий співробітник",
    department: "Відділ аналізу безпеки радіаційно-небезпечних об’єктів, відділення проєктування об’єктів з радіаційно-ядерними технологіями",
    type: "Конкурс",
    requirements: [
      "Конкурс оголошено 28.09.2026, термін конкурсу — 45 днів від дня оголошення",
      "Одна вакансія",
    ],
    conditions: "Заяви й відповідні документи для участі в конкурсі надсилати ученому секретарю інституту за адресою: вул. Лисогірська, 12, м. Київ, 03028, Інститут проблем безпеки АЕС НАН України.",
    href: "/a-competition-has-been-announced-to-fill-the-vacant-position-of-senior-researcher",
  },
  {
    id: 4,
    title: "Головний науковий співробітник",
    department: "Відділ радіаційної екології, відділення атомної енергетики",
    type: "Конкурс",
    requirements: [
      "Конкурс оголошено 01.08.2026, термін подання документів — 45 днів з дня оголошення",
      "Одна вакансія",
    ],
    conditions: "Заяви й відповідні документи для участі в конкурсі надсилати ученому секретарю інституту за адресою: вул. Лисогірська, 12, м. Київ, 03028, Інститут проблем безпеки АЕС НАН України.",
  },
];

export const statusColors: Record<string, string> = {
  "Повна зайнятість": "bg-green-100 text-green-800",
  "Часткова зайнятість": "bg-yellow-100 text-yellow-800",
  "Контракт": "bg-blue-100 text-blue-800",
  "Конкурс": "bg-purple-100 text-purple-800",
};
